; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v7 - type_3 ?v3 - type_2)
 	      (pred_2 ?v5 - object ?v3 - type_2)
	      (pred_3 ?v7 - type_3 ?v6 - type_1)
	      (pred_1 ?v7 - type_3 ?v5 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v7 - type_3 ?v4 ?v2 - type_2)
       :precondition (and  (pred_4 ?v7 ?v4))
       :effect (and  (pred_4 ?v7 ?v2)
		     (not (pred_4 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_3 ?v1 - object ?v8 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v8) (pred_4 ?v7 ?v8) (pred_3 ?v7 ?v6))
       :effect (and (pred_1 ?v7 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v8)) 
		    (not (pred_3 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_3 ?v1 - object ?v8 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v1 ?v6) (pred_4 ?v7 ?v8))
       :effect (and (pred_2 ?v1 ?v8)
		    (pred_3 ?v7 ?v6)
		    (not (pred_1 ?v7 ?v1 ?v6)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_3
obj_07 obj_09 - type_1
obj_05 obj_01 obj_04 - type_2
obj_08 obj_06 obj_03 - object)
(:init
(pred_4 obj_02 obj_05)
(pred_3 obj_02 obj_07)
(pred_3 obj_02 obj_09)
(pred_2 obj_08 obj_01)
(pred_2 obj_06 obj_05)
(pred_2 obj_03 obj_05)
)
(:goal
(and
(pred_2 obj_08 obj_04)
(pred_2 obj_06 obj_04)
(pred_2 obj_03 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_02 ?b obj_09))))
)
)

; plan
1. (op_1 obj_02 obj_06 obj_05 obj_07)
   deleted: (pred_2 obj_06 obj_05) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_06 obj_07)
   goals met: 0 of 3
2. (op_3 obj_02 obj_05 obj_04)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_04)
   goals met: 0 of 3
3. (op_2 obj_02 obj_06 obj_04 obj_07)
   deleted: (pred_1 obj_02 obj_06 obj_07)
   added: (pred_2 obj_06 obj_04) (pred_3 obj_02 obj_07)
   goals met: 1 of 3
4. (op_3 obj_02 obj_04 obj_01)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_01)
   goals met: 1 of 3
5. (op_1 obj_02 obj_08 obj_01 obj_07)
   deleted: (pred_2 obj_08 obj_01) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_08 obj_07)
   goals met: 1 of 3
6. (op_3 obj_02 obj_01 obj_04)
   deleted: (pred_4 obj_02 obj_01)
   added: (pred_4 obj_02 obj_04)
   goals met: 1 of 3
7. (op_2 obj_02 obj_08 obj_04 obj_07)
   deleted: (pred_1 obj_02 obj_08 obj_07)
   added: (pred_2 obj_08 obj_04) (pred_3 obj_02 obj_07)
   goals met: 2 of 3
8. (op_3 obj_02 obj_04 obj_05)
   deleted: (pred_4 obj_02 obj_04)
   added: (pred_4 obj_02 obj_05)
   goals met: 2 of 3
9. (op_1 obj_02 obj_03 obj_05 obj_07)
   deleted: (pred_2 obj_03 obj_05) (pred_3 obj_02 obj_07)
   added: (pred_1 obj_02 obj_03 obj_07)
   goals met: 2 of 3
10. (op_3 obj_02 obj_05 obj_01)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 3
11. (op_2 obj_02 obj_03 obj_01 obj_07)
   deleted: (pred_1 obj_02 obj_03 obj_07)
   added: (pred_2 obj_03 obj_01) (pred_3 obj_02 obj_07)
   goals met: 3 of 3
